// Festival Dialogue 

{
    "Changes": [
        //Egg Festival
        {
            "Action": "EditData",
            "Target": "Data/Festivals/spring13",
            "Entries": {
                "Sebastian": "You have no idea how tempted I am to sabotage Abigail in the egg hunt.$7#$b#I can't take another year listening to her brag about outdoing little kids.$2",
                "Sebastian_spouse": "All of these eggs make me think we should've just had breakfast in bed.#$b#You could've cooked us a nice meal while wearing nothing but an apron.$4"
            }
        },
        //Flower Dance
        {
            "Action": "EditData",
            "Target": "Data/Festivals/spring24",
            "Entries": {
                "Sebastian": "I wish they'd just get rid of this awkward festival already.$2",
                "Sebastian_spouse": "It would've been nicer to have spread flower petals out on the bed and just done our own dance there.$4"
            }
        },
        //Desert Festival
        {
            "Action": "EditData",
            "Target": "Strings/1_6_Strings.xnb",
            "Entries": {
                "DesertFestival_Sebastian_marriage": "You're lucky I love you so much, gem.#$b#I'm only doing this for you.",
                "DesertFestival_Sebastian": "The desert is way too hot.$2#$b#Sam's dragged me here a few times to collect cactus fruit and to fu—#$b#Never mind.",
                "Shop_Sebastian": "Oh, hey, @.$7#$b#Thanks for swinging by. Definitely makes this a little less torturous.$1#$b#Don't feel obligated to buy anything, okay?$7"
            }
        },
        //LUAU
        {
            "Action": "EditData",
            "Target": "Data/Festivals/summer11",
            "Entries": {
                "Sebastian": "Yet another year of the governor gorging himself on soup.$2#$b#Sam can, will, and does sabotage it every time.$7",
                "Sebastian_spouse": "We should just ditch. The beach is so hot.$2#$b#Even worse is that YOU'RE so hot. I can't put my hands on you with all of these losers here.$5#$b#Unless...$4"
            }
        },
        //Moonlight Jellies
        {
            "Action": "EditData",
            "Target": "Data/Festivals/summer28",
            "Entries": {
                "Sebastian": "Frogs are definitely my favorite animal, but the moonlight jellies come close.$7",
                "Sebastian_spouse": "The jellies are so ethereal....#$b#Just like you, gem.$4"
            }
        },
        //Fall Fair
        {
            "Action": "EditData",
            "Target": "Data/Festivals/fall16",
            "Entries": {
                "Sebastian": "I hate being around so many people, but even I have to admit that the fair is kinda fun.",
                "Sebastian_spouse": "Would you like it if I fucked you on your grange display?$4#$b#It'd have to be after everyone cleared out, though, because they don't deserve to see my gem like that.$4"
            }
        },
        //Spirit's Eve
        {
            "Action": "EditData",
            "Target": "Data/Festivals/fall27",
            "Entries": {
                "Sebastian": "I won't blame you if you end up punching Sam in the face when he tries to scare you.$7#$b#Maybe we can get him to just scare Abigail.$1",
                "Sebastian_spouse": "If you be a good boy and keep quiet, we can sneak off into the dark and have some fun.$7^If you be a good girl and keep quiet, we can sneak off into the dark and have some fun.$7#$b#Would you like that?$7#$b#Me fucking your brains out with everyone so close?$4"
            }
        },
        //Ice Festival
        {
            "Action": "EditData",
            "Target": "Data/Festivals/winter8",
            "Entries": {
                "Sebastian": "The cold is way better than the heat.#$b#Summers get way too hot here.",
                "Sebastian_spouse": "Maybe I could commission someone to make an ice sculpture of you....$7#$b#Although, I'd be sad watching my poor gem melt from anything other than my touch.$4"
            }
        },
        //Winter Feast
        {
            "Action": "EditData",
            "Target": "Data/Festivals/winter25",
            "When": {
                "Language": "en",
                "Relationship:Sebastian": "Dating"
            },
            "Entries": {
                "Sebastian": "I really hope Shane isn't the one giving me a gift.$2#$b#I bet it'd be an empty beer bottle or a piece of paper with 'I.O.U.' written on it.$2",
                "Sebastian_spouse": "Don't worry, gem.#$b#I've got a wonderful present to give you later.$7#$b#Let's just say you probably won't be walking tomorrow.$4"
            }
        }
    ]
}