// Marriage & Marriage Related Dialogue
{
    "Changes": [
        {
            "LogName": "Seb's Married Rejection Dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/Sebastian",
            "Entries": {
                "FlowerDance_Accept_Spouse": "I really don't like dancing, but since it's my gem asking, I can't say no.$4",
                "SpouseStardrop": "Look what I found for you.$4#$b#Abigail wanted it, but I told her there was no chance in hell I was giving it to her instead of you.$1",
                "SpouseGiftJealous": "Don't think I don't know when you give other guys gifts.$5#$b#Just because we're married now doesn't mean I stopped keeping tabs on you.$5"
            }
        },
        {
            "LogName": "Universal, but still Seb's Marriage Dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/MarriageDialogue",
            "Entries": {
                "Rainy_Day_Sebastian": "I love the rain, but I love my little gem far more.$4#$b#%Sebastian gently traces one side of your jawline before cupping your cheek and kissing you.",
                "Rainy_Night_Sebastian": "The sound of the rain on the roof always helps me sleep better.$7#$b#Holding you in my arms is the best thing to help with my insomnia, though.$4",
                "Indoor_Day_Sebastian": "Even though I'm not living in the basement anymore, I still spend so much time inside.#$b#I'd like to spend more time inside you.$4",
                "Indoor_Night_Sebastian": "I pulled out a fresh set of sheets.#$b#Let's make a mess before we change them.$4#$b#%Sebastian gropes your ass before giving it a little pat.#$b#Get in bed, gem.$7",
                "Outdoor_Sebastian": "I'm trying to get out of the house more when I don't have work.#$b#Getting to see my little gem working is a pretty good motivator.$4",
                "spring_Sebastian": "When I lived in the basement, I didn't have any windows to open.#$b#Smelling the flowers through the open windows is refreshing: way better than the dank basement.$1",
                "summer_Sebastian": "I'm too pale to be out in the sun for long periods of time.#$b#I have to use so much sunblock just to avoid turning into a lobster.$2#$b#Seeing you hard at work is worth it, though.$4",
                "fall_Sebastian": "Fall is great for hoodies.#$b#I love it when you wear them with nothing on underneath them.$4#$b#I'm the only one that gets to see you like that. Understood?$5",
                "winter_Sebastian": "Since it's winter, you can't plant as much.#$b#That means we've got more time to snuggle.$4#$b#I love it when we go from snuggling to fucking just because our hands start wandering.$7"
            }
        },
        {
            "LogName": "Seb's Married Dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/MarriageDialogueSebastian",
            "Entries": {
                "Rainy_Day_0": "Finally, some rain.#$b#I get bored of sunny weather easily, and I haven't gotten a chance to see you soaked to the bone and shivering for a while.$1",
                "Rainy_Day_1": "Before we moved in together, I didn't really get to appreciate the rain.#$b#I couldn't hear it well in the basement.$2#$b#I also didn't get to see you with your clothes clinging to you nearly as much.$1",
                "Rainy_Day_2": "I couldn't sleep last night, so I went and wandered around the caves.#$b#I miss following you around down there.$7#$b#Oh, yeah, I almost forgot: I found this down there. It's for you.$1[84]",
                "Rainy_Day_3": "Seems like a perfect day to just lounge around inside.#$b#Of course, we could always do more than just lounge around.$7",
                "Rainy_Day_4": "Another rainy day. Perfect!$1#$b#I wanted to spend the day with you in my arms.$7#$b#A day with you beneath me sounds good, too.$4",
                "Rainy_Night_0": "While I love the rain, it makes it hard to actually smoke.$2#$b#If it rained all of the time, it'd be easier for me to quit.#$b#It'd also give us more time to spend together inside, tangled up in the sheets.$4",
                "Rainy_Night_1": "$y 'Mind if I work on my laptop?_No, that's fine!_Thanks. I want to try to get more work done on my game.$1_I do mind, actually._Oh? Are you jealous that my computer would be in my lap instead of you?$1'",
                "Rainy_Night_2": "I was hoping the rain would stop by now.#$b#I wanted to take you for a ride tonight.$2",
                "Rainy_Night_3": "How was your day? Did you slay any monsters?$h#$b#It feels good to take out your aggression now and then, doesn't it?$7#$b#You like it when I take mine out on you in bed, don't you, gem?$4",
                "Rainy_Night_4": "I thought about inviting Abigail and Sam over for a boardgame night, but the rain still hasn't let up.$2#$b#That's okay, though. That means there's no one to distract you from me.$4#$b#Let's play a game of our own. I like to call this one 'Dom and Sub.'$7#$b#What do you say, gem?$1",
                "Rainy_Night_5": "I hope the rain turns into a thunderstorm.$7#$b#I love the way you jump whenever there's thunder.$4#$b#It reminds me of how you'd jump whenever you'd hear the bushes rustle when you thought you were alone.$1",
                "Indoor_Day_0": "I've got a big project to work on today, but I'll try to get some cleaning done.$7#$b#We made a pretty big mess last night.$4",
                "Indoor_Day_1": "As soon as you get home, I'll put my laptop away, and we can take a shower together.$4",
                "Indoor_Day_2": "You always tell me to take a break from work so I don't wear myself out.#$b#This is me telling you to do the same.$1#$b#We can't have any fun if you're completely exhausted.$2",
                "Indoor_Day_3": "I wish you could put off work for the day.$2#$b#I have some interesting new positions I found on the internet that I want to try out.$7#$b#I don't think I can wait.$2",
                "Indoor_Day_4": "$y 'Will you give me at least a few hours before you head out for the day?_Sure._Great. You and I have a date between the sheets.$4_Sorry, but no._Do you even love me?$5'",
                "Indoor_Night_0": "I still have a lot to do for this client's project.$2#$b#How about I keep working on it, and you slip in that little vibrator you love?$7#$b#You can't come until I finish my project, though.",
                "Indoor_Night_1": "Do you want me to fill you up tonight?$1#$b#I've noticed that you've become even more of a cumslut over time.$4#$b#You're only a cumslut for me, right?$5",
                "Indoor_Night_2": "What do you mean I ignored you earlier?$5#$b#You must be imagining things.$5#$b#I'd never ignore my precious gem.$1",
                "Indoor_Night_3": "$y 'What did you think of the project I showed you this morning?_It looked really, really good!_I knew my gem would always be supportive.$1_To be honest, it was pretty shitty._Excuse me?$5#$b#While I never want you to lie to me, you should watch your mouth and think about how you talk to me.$5'",
                "Indoor_Night_4": "The marks I left on your neck have almost completely faded.$2#$b#Let me fix that.$4#$b#I can't have people forgetting who your owner is.$5",
                "Outdoor_0": "I hate being outside, so me being out here should tell you just how much I love you.$2",
                "Outdoor_1": "I swear that I'm trying to quit smoking, gem.#$b#I'd give up cigarettes before I'd ever give you up.#$b#No one can take you from me.$5",
                "Outdoor_2": "I've started appreciating nature more since making you mine.$4#$b#I'm still not a fan of the outdoors, though.$2",
                "Outdoor_3": "If you go into town today, you better not talk to any other guys.$5#$b#My gem wouldn't ever dare do that, though, right?$1",
                "Outdoor_4": "I wish that we lived closer to the caves.$2#$b#They're nice and dark, which helps with the whole hating the outdoors thing.$7",
                "patio_Sebastian": "%Sebastian whispers in your ear that he has a surprise for you later that night.#$b#%He tells you to save as much energy as you can because you'll definitely need it.",
                "OneKid_0": "I know %kid1 can be a handful, so I got you this as a pick-me-up.$7[243]",
                "OneKid_1": "I wonder if %kid1 will grow up to dress more like you or more like me.$1",
                "OneKid_2": "Do you think %kid1 would be happier with a sibling?",
                "OneKid_3": "I never thought I'd be a parent.#$b#Honestly, I... don't really want to be.$2#$b#Since it's with you, though, it's not the worst thing in the world.$4",
                "TwoKids_0": "I'm glad %kid1 generally likes %kid2.#$b#I think I'd lose my mind dealing with them if they fought all of the time.$2",
                "TwoKids_1": "$y 'You've never thought about what your kids would look like with other guys, have you?_Of course not._Good boy.^Good girl._I mean..._You need to go away right now before you make me say or do something I'll regret.$5'",
                "TwoKids_2": "Hopefully, %kid1 and %kid2 will grow up to be a lot closer than Maru and me.",
                "TwoKids_3": "Two kids is more than enough.#$b#Half of the time, two kids is two too many.$2",
                "Good_0": "I'll never let you go, even if you want to.$1#$b#You're mine forever, @.$4",
                "Good_1": "Could you bend over really quickly? I need to take in the view to get ambition to work today.$1",
                "Good_2": "When you're covered in mud after working all day...#$b#I just can't help but think about pressing you up against the wall of the shower and making another mess you'll have to clean.$4",
                "Good_3": "I'm not always the greatest at showing it, but I'm glad you chose to accept my love.$4#$b#There's no way I would have ever stopped if you didn't.$4",
                "Good_4": "I love the sound of you moaning, but sometimes, the sound of you choking on my cock gets me going more than anything.$4",
                "Good_5": "Days where we get to go for more than one round are the best.$4",
                "Good_6": "I love you more than anything else in the universe.$1#$b#You know I'd kill for you, right?$4",
                "Good_7": "I don't know what I would've done if you chose one of the other guys.$2#$b#None of them could ever love you more than I do.$5",
                "Good_8": "Will you put on that cute, little outfit I got you tonight?$4#$b#You know I like fantasy things, and you'd make the cutest elf prince.^You know I like fantasy things, and you'd make the prettiest elf princess.$4",
                "Good_9": "I don't need any friends when I have you.$4#$b#You feel the same way, right?$2#$b#You don't need anyone other than me, and there better not be anyone other than me.$5",
                "Neutral_0": "I'm not feeling very talkative today.$2#$b#Can you put your tongue to better use?$h",
                "Neutral_1": "I'm sorry, gem, but I don't really have time to hear about your day right now.#$b#The deadline for this project is coming up quick.$2#$b#Rather than talking, do you think you could work your magic with those hands?#$b#I have a kink in my neck from sitting weird while working.$2",
                "Neutral_2": "Why are you going into town today?$2#$b#It's not like we need anything from the store.#$b#You're not going to see someone else, are you?$5#$b#You'd never do that to me, right?$5",
                "Neutral_3": "Are we doing alright on money?$2#$b#If not, you're just going to have to work harder.$1#$b#I'm not selling my laptop.$5",
                "Neutral_4": "When you're in town, don't waste time talking to people unless you absolutely have to.$2#$b#I want you right here where I can see you, gem.$4",
                "Neutral_5": "Can you start helping with chores?#$b#You're not the only one with a job around here.$2#$b#I'll reward you if you do.$1",
                "Neutral_6": "Sam and Abigail want me to meet them at the saloon tonight.#$b#I'm only going to go if you come with.#$b#You wouldn't want to take that time away from me, now would you?$2",
                "Neutral_7": "I know you're the one with a praise kink, but how come YOU never compliment ME?$2#$b#Well, there's not much to compliment me on, if I'm being honest with myself.$2",
                "Neutral_8": "I hope you know that everything you do when you're not with me gets back to me eventually.$2",
                "Neutral_9": "$y 'You never think about what it would be like if you chose my best friend over me, do you?$5_No, of course not._Good. You better not.$2_Once or twice, yeah._Well, you better just be thinking about how you made the right choice letting me own you.$5'",
                "Bad_0": "Are you trying to bankrupt us by wasting money on gifts for other guys?$5#$b#It'd be cheaper for you to just be obvious about cheating on me....$2#$b#You might as well just spread your legs for them at this point as a 'gift.'$5#$b#That's what you want to do anyway, isn't it?$5",
                "Bad_1": "Don't make me treat you like an animal.#$b#I'm your owner. Remember that.$5",
                "Bad_2": "With how badly you've been annoying me lately, I feel like I'm married to Abigail.$2#$b#You are NOT behaving like the person I fell in love with.$5",
                "Bad_3": "If you keep it up, I might just lock you in Elliott's cabin until you promise to behave.$5",
                "Bad_4": "I'm so close to buying a cage to put you in.$5#$b#Stop being such a brat.$5#$b#The only place you can be a brat is in bed.$2",
                "Bad_5": "You might think your place is out on the farm, but you're wrong.$2#$b#Your place is on your knees in front of me.",
                "Bad_6": "I'm gaslighting you?$2#$b#Keep telling yourself that. Maybe if you repeat it enough, you can convince yourself it's true.$2#$b#You're practically gaslighting yourself at this point.",
                "Bad_7": "You're lucky the only thing I make you beg for is my cock.$5",
                "Bad_8": "Instead of spewing bullshit at me, why don't you go start a gloryhole somewhere?$5#$b#That way, you can suck everyone else's cocks like you clearly want to.$5#$b#I won't have to hear your lies if you're busy gagging on another guy's dick.$5",
                "Bad_9": "If you keep ogling other guys like that, I might just have to remove your eyes.$2#$b#Keep your eyes on me... and ONLY me.$5",
                "funLeave_Sebastian": "I'll have to pick up a treat for my precious gem when I go out today, won't I?$1",
                "funReturn_Sebastian": "Here, I thought you'd like something sweet but not too sweet: just like you and me.$4[234]",
                "spouseRoom_Sebastian": "It's nice having a room above ground.$1#$b#I found this in the caves, and since it looks like a little sun...[768]#$b#I thought it was fitting. You gave me a reason to leave that basement and see the sun.$4",
                "spring_1": "Since it's a new year, I'll have to refresh everyone's memory on who your owner is.$4",
                "spring_4": "I don't know why, but spring always makes me want to write you letters like those old ones I sent you.$1",
                "spring_8": "You're lucky that you don't have allergies.#$b#You'd be sneezing nonstop with all of this pollen.$7#$b#It wouldn't be good if you sneezed while sucking me off.$2",
                "spring_12": "Are you ready for the Egg Festival tomorrow?$7#$b#You need to beat Abigail this year. I'm so sick of listening to her gloating.$2#$b#Imagine being proud of yourself for winning against a bunch of kids.$2",
                "spring_16": "The Desert Festival combines two things I hate: the desert and festivals.$2",
                "spring_23": "The Flower Dance is tomorrow, and you still haven't asked me to be your dance partner.$2#$b#What? Who cares if I don't like dancing?$5#$b#I'm the only one you can dance with.$5#$b#You didn't ask someone else, did you?$5",
                "summer_1": "Now that it's summer, you'll probably be taking more showers, right?#$b#I want to join you for every single one.$7#$b#You shine when you're all wet, gem.$7",
                "summer_7": "Want me to help you apply some sunblock?$7#$b#My hands will only wander a bit. I promise.$1",
                "summer_10": "The luau is tomorrow.#$b#I really don't want to go to the crowded beach.$2#$b#The only good thing about the luau is getting to spend time with you.$4",
                "summer_16": "It's so humid today.$2#$b#It's like I'm swallowing water every time I breathe in.$2#$b#Is this what you feel like when I come in your mouth?$7",
                "summer_20": "Isn't it the trout derby today?#$b#I don't want all of those random people from the valley thinking you're available.$5#$b#Come here so I can leave some marks so they know you already have an owner.$7",
                "summer_24": "Does anyone ask you about the bruises on your wrists when you're out?#$b#If they do, you better tell them that they're from me so they know to back off.$2",
                "summer_27": "The moonlight jellies arrive tomorrow night.$7#$b#Are you ready to watch them together?$1#$b#Because you're not watching them with anyone else.$5",
                "fall_1": "Finally, summer's over.#$b#I hate the way the other guys eye you up when you're all covered in sweat.$5#$b#I bet they'd lick you clean if they got the chance.$5#$b#The only person that gets to put their tongue on you is me.$5",
                "fall_8": "Whenever you wear a scarf, I can't help but want to choke you out with it.$7#$b#Your eyes are gorgeous, but there's just something...#$b#...special about them when the light's fading from them.$4",
                "fall_15": "If I had a grange display for the fair tomorrow, you'd be the only thing worth putting in it.$4",
                "fall_18": "I can't get that image of you sitting pretty in a grange display out of my head.$4#$b#Would you like it if I had you ride my cock in front of the whole town?$7#$b#If they saw me come inside you, they'd know for sure who owns you.$4",
                "fall_20": "Yeah, sure, whatever: it's a beautiful day outside.$2#$b#There are way more beautiful things I'd rather look at.$2#$b#For example, watching my cock slide in and out of you is one of the most beautiful sights in the world.$4",
                "fall_26": "Spirit's Eve is tomorrow.#$b#While I like wandering around in the dark, I don't really want to go.$2#$b#I'd much rather look at you with your head thrown back in ecstasy than some poorly-carved jack-o-lanterns.$7#$b#",
                "winter_1": "Well, it's finally winter.#$b#People always talk about blankets of snow, but I'm way more interested in the blankets on our bed.$7#$b#Why don't we go crawl back under them, gem?$4",
                "winter_7": "The Festival of Ice is tomorrow, and I have no desire whatsoever to go.#$b#I'd much rather stay at home and fuck your mouth.$2",
                "winter_9": "Tomorrow morning, I want you to wake me up with a blowjob.$1#$b#Why? Because it'll be my birthday.#$b#You didn't forget, did you?$5",
                "winter_17": "$y 'It's the last day of the Night Market tonight. Did you plan on going?_Yeah!_Well, if that's the case, you better have the vibrator in while you walk around.$2_Nah._Good. That means you can spend more time stretched around my cock.$4'",
                "winter_25": "I know it's just the tradition of the Feast of the Winter Star, but...#$b#I don't want you giving anyone other than me a gift.$5",
                "winter_28": "What do you say about riding my cock into the new year, gem?$4"
            }
        }
    ]
}