// General Dialogue
{
    "Changes": [
        {
            "LogName": "Seb's Unmarried Rejection & Jealousy Dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/Sebastian",
            "Entries": {
                // rejections 
                "FlowerDance_Decline": "The dance is so... cringey.$2#$b#It just looks so awkward.$2#$b#You're too cute to embarrass yourself doing it.$2",
                "RejectBouquet_VeryLowHearts": "It wouldn't be any fun if it was that easy.$h",
                "RejectBouquet_LowHearts": "You haven't even given me a chance to chase you yet.$2",
                "RejectBouquet_Divorced": "You're the one that divorced me, and you're trying to get me back?$5#$b#Unless you beg me, I'll just continue to make you regret leaving me.$5",
                "RejectGift_Divorced": "I don't want this.$5#$b#The only gift I'll accept is you down on your knees, begging for me to take you back.$5#$b#While you're down there, you can put your mouth to good use.$2#$b#%Sebastian looks like he's close to losing it if you don't do what he says or go away.",
                "RejectMermaidPendant": "Not yet.#$b#I want to learn every little thing about you first.$h",
                "RejectMermaidPendant_Under10Hearts_AskedAgain": "I haven't learned everything there is to learn about you yet.#$b#Be patient, gem.$7",
                "RejectMermaidPendant_Divorced": "You're essentially asking me to toy with your body again while you're toying with my feelings.$5",
                "RejectMermaidPendant_NeedHouseUpgrade": "You don't have a big enough house for the things I want to do to you.$2",
                "RejectMermaidPendant_NpcWithSomeoneElse": "If you can figure out a way to get rid of {0}, I'll gladly be your official owner.$7",
                "RejectMermaidPendant_PlayerWithSomeoneElse": "You're insane if you think I'll share you with %spouse.$5",
                "RejectMovieTicket": "I've got my own movies to watch.$2#$b#You make a new one for me every time you hop in the shower.$7",
                "divorced": "%Sebastian glares at you, volatile emotions flashing across his face.#$b#%The way he's staring at you makes you feel like prey frozen in the jaws of a predator.",
                "breakUp": "The property doesn't get to decide to leave the owner.$5#$b#It's the other way around, gem.$5#$b#I'll make sure you regret this.",
                "dumped_Guys": "The property doesn't get to decide to leave the owner.$5#$b#It's the other way around, gem.$5#$b#I'll make sure you regret this.",
                "secondChance_Guys": "I knew you'd come crawling back.$7#$b#You couldn't get my cock off of your mind, could you, gem?$7",
                //jealousy ;)
                "dating_Sam": "I warned him not to take you from me.$5#$b#I see he didn't listen.$2#$b#I don't know which one of you deserves to be punished more.$5",
                "dating_Alex": "How can you even stand talking to him?$2#$b#I thought I had you pinned down, but maybe you're a lot more vapid than you let on.$2",
                "dating_Elliot": "I can't even stand to think about that creep touching you.$5#$b#What are you even getting out of dating him, other than terrible poems?$2",
                "dating_Harvey": "You're dating Harvey?#$b#Dating Harvey screams 'daddy issues,' if you ask me.$2",
                "dating_Shane": "Don't you have enough dirty animals to take care of?$2",
                "married_Sam": "I can't believe that you two actually went through with it.$5#$b#Do my feelings mean nothing to either of you?$5#$b#Well, every time you two have sex...$2#$b#...just remember that I rode his cock before you ever did.$5",
                "married_Alex": "So, has Alex asked if he could lube up his gridball and shove it up your ass yet?$5#$b#It sounds like something he'd want to do, seeing as he can only think about that dumb ball.$5",
                "married_Elliot": "Is Elliott trying to compensate for a pathetic dick with those hobbies of his?#$b#Actually, don't tell me.$5#$b#I don't want to think about you anywhere near his dick.$5",
                "married_Harvey": "I'm going to look for a doctor in the city.$5#$b#I don't want Harvey's hands on me after they tainted MY gem.$5",
                "married_Shane": "Does Shane just hand you a beer bottle to pleasure yourself with so he can go throw up and pass out?$5"
            }
        },
        // Movie Reactions
        {
            "LogName": "Seb's Movie Dialogue",
            "Action": "EditData",
            "Target": "Strings/MovieReactions.xnb",
            "Entries": {
                // Look at xnb file for these 
                "Sebastian_love_BeforeMovie": "I've heard that this movie's pretty good.$7#$b#Let's enjoy it together, gem.",
                "Sebastian_love_DuringMovie": "%Sebastian whispers in your ear.#$b#Thanks for inviting me. I'm really enjoying being here with you.$1",
                "Sebastian_love_DuringMovie_2": "%You catch Sebastian glancing at you.#$b#%When you look back at him questioningly, he smiles.#$b#The glow of the screen on your face looks... ethereal.$4",
                "Sebastian_love_AfterMovie": "Best movie I've seen in a while.#$b#If the next one sucks, will you suck me off during it to distract me from how bad it is?$7",
                "Sebastian_like_BeforeMovie": "I'm hoping this one will be good.#$b#The poster made it look promising.#$b#I wish I could put you on a poster.$2#$b#Wait, I could. Graphic design's not hard.$7#$b#I just need a bigger printer.$1",
                // Add a when clause.
                "Sebastian_like_AfterMovie": "It wasn't the best ever, but it also wasn't the worst.#$b#We should keep this night going, and I know a good way to do so.$7",
                "Sebastian_dislike_BeforeMovie": "I hope you know that I'm only watching this for you, gem.$2",
                "Sebastian_dislike_AfterMovie": "I suffered through that for you, so...$2#$b#...let's just say you're going to suffer later.$1"
            }
        },
        {
            "LogName": "Seb's Spouse Movie Invite",
            "Action": "EditData",
            "Target": "Strings/Characters.xnb",
            "Entries": {
                "MovieInvite_Spouse_Sebastian": "I'll only come with if you promise to be a good boy.$4^I'll only come with if you promise to be a good girl.$4"
            }
        },
        // For those who can't help but snoop in his stuff
        {
            "LogName": "A little Easter Egg ;)",
            "Action": "EditData",
            "Target": "Strings/StringsFromMaps.xnb",
            "Entries": {
                // Item descriptions for Seb's room
                "SebastianRoom.1": "You pop open the CD player on the radio to see a CD with 'Best Songs to Fuck To' scribbled on it.",
                "SebastianRoom.2": "Why do the main characters in this graphic novel look like you and Sebastian?",
                "SebastianRoom.3": "A roleplaying boardgame. Why do you feel like Sebastian's probably into some... other kind roleplaying?"
            }
        },
        {
            "LogName": "Seb's Unmarried Special Dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/Sebastian",
            "Entries": {
                "FlowerDance_Accept": "While I hate dancing...#$b#...I'll do it for you.$4",
                "AcceptBouquet": "I'm glad you're finally accepting my love.$1#$b#My little gem's so smart.$1#$b#%Sebastian's tone as he calls you smart is patronizing.",
                "give_pendant": "You know this means I'll officially own you, right?$7",
                "dating_Sebastian": "I'll try to keep these alive as long as possible.$7#$b#I know I'll be able to take way better care of you, though, gem.",
                "HitBySlingshot": "Watch where you aim that thing, or I won't watch my aim when I come on your face.$5#$b#Don't cry about it if it gets in your eye.$1",
                "GreenRain": "This is kind of wicked... in a cool way.$7",
                "GreenRainFinished": "I'm kind of disappointed that it's over.$2",
                "GreenRain_2": "I wonder what causes this rain.",
                "firstVisit_Sewer": "You're as filthy as Shane.$2",
                // Location Based
                "Resort_Entering": "This'll be fun: just you, me, and somewhere no one can bother us.$4",
                "Resort": "It's actually not too bad out here. I was expecting it to be hot and gross.$7",
                "Resort_Leaving": "I'm going to have to buy more sunblock. I went through a whole bottle of it.$2",
                "Resort_Shore": "I can help you put on sunblock.$1#$b#We don't want that pretty skin of yours burning.$7",
                "Resort_Towel_2": "You look radiant in the sun, gem.$1",
                "Resort_Bar": "Don't worry. I already know what you like to drink.$7#$b#Just sit back, and I'll bring you what you want.$1",
                "Saloon": "Nice to see you here.#$b#Hm? Don't mind me.#$b#I'll just be keeping an eye on you from over here.$7",
                "Saloon8": "There are things I'd like to do to you that aren't exactly appropriate to do in the saloon.$7#$b#How about we do them behind the saloon instead?$4"
            }
        },
        {
            "LogName": "Seb's Unmarried Dialogue",
            "Action": "EditData",
            "Target": "Characters/Dialogue/Sebastian",
            "Entries": {
                "Introduction": "I don't really like talking to new people, but... I think I can make an exception for you.",
                // GENERIC DIALOGUE 
                "Mon": "My step-dad really gets on my nerves....$2#$b#Hopefully, you won't.$4",
                "Tue": "If my smoking bothers you, that's a you problem.$2",
                "Wed": "I have nothing in common with my step-sister.$2#$b#Honestly, I don't have anything in common with ANY of my family.$2",
                "Thu": "Have you found anything cool in the caves?#$b#I like going in there. Some spots have too many monsters, though.$2",
                "Fri": "Are you only talking to me because you want something from me?$2",
                "Sat": "I wish I could just leave this town already.$2",
                "Sun": "It'd be nice if I could ride my motorcycle more.$2#$b#When I move to the city, I'll be able to ride way more often.$7",
                // HEART-BASED DIALOGUE
                "Mon2": "I'm glad I didn't tell you to just fuck off when you introduced yourself.#$b#You're proving to be pretty interesting.$4",
                "Tue2": "If you have any extra frozen tears lying around, I wouldn't mind if you gave them to me.$7",
                "Wed2": "It's hard to connect with people that are really different than me.$2#$b#I feel like I can probably get close to you, though, regardless of what you are or aren't.$4",
                "Thu2": "I don't like making small talk.$2#$b#That's why I avoid almost everyone in town.#$b#I don't feel like I need to avoid you, though.$4",
                "Fri2": "If you're ever bored, feel free to hang out in my room.$7#$b#Just stay away from my computer.$2",
                "Sat2": "Abigail wouldn't stop staring at me at the saloon last night when Sam and I were playing pool.$5#$b#She thinks I don't notice it.$2",
                "Sun2": "People think I never leave the basement.$2#$b#I'm out and about more than they'll ever know.$1",
                "Mon4": "You should be more careful at night. Weird people pass through the valley.#$b#Who knows if they're out there in the dark?",
                "Tue4": "Why do people always bother me when I'm busy?$5#$b#It doesn't matter if I'm in my room or outside.$5",
                "Wed4": "I saw you nearly trip the other day.#$b#Watch where you're walking before you end up hurting yourself.",
                "Thu4": "Do you really not notice how everyone in town is always looking at you?$2#$b#%Sebastian mumbles something to himself that you don't quite catch.",
                "Fri4": "%Sebastian looks irritated but smiles when he notices you.#$b#%There's something slightly off about the smile, but if asked, you wouldn't be able to say what it was.#$b#%You just smile back.",
                "Sat4": "Did you know that you can commission people for custom-made graphic novels?#$b#Pretty awesome, right?$1",
                "Sun4": "If you ever want a CD, just let me know. I can burn you one.$7#$b#Just let me know what songs you want.$7#$b#I've made a bunch of CDs for myself before.$1",
                "Mon6": "I've had others tell me that I'm dark and brooding.#$b#Is it just because I'm wearing black?$2#$b#You're not like them... are you?$5#$b#You don't think I'm undesirable or something because of the way I dress, right?$4",
                "Tue6": "Your skin looks great in the moonlight.$4",
                "Wed6": "I thought I saw Elliott following you yesterday.$5#$b#I'd keep an eye on him if I were you.$2",
                "Thu6": "How does it feel to be so perfect?$4",
                "Fri6": "Maru's so two-faced.$2#$b#She's all nice and smiley with everyone but me, and I know that that's the real Maru.$5",
                "Sat6": "Shane reeked of booze even worse than usual when we were at the saloon last night.$2#$b#Doesn't he realize that no one's ever going to want to marry a drunk like him?$1",
                "Sun6": "Is your hair as soft as it looks?#$b#You should let me touch it.$4",
                "Mon8": "Sam keeps asking if I'll invite you over to play Solarion Chronicles again.#$b#I hope he doesn't think he stands a chance taking you from me.$5",
                "Tue8": "You slept pretty roughly last night, gem.#$b#I know you'd sleep much better if you were in my arms.$4",
                "Wed8": "I thought I saw something weird on the cameras earlier, but it was just your pet running around.#$b#If anyone else had been your house...$5",
                "Thu8": "If you ever want to borrow any of my graphic novels, just ask.$7#$b#I'll share anything with you.$1",
                "Fri8": "My days go by so slowly when you're not around.$2#$b#Good thing I can watch you on the cameras.$4",
                "Sat8": "I'm getting really sick of getting the side-eye from Abigail and Maru all of the time.$5",
                "Sun8": "Your pet has really gotten to like me.$7#$b#Any time I walk onto your farm, it comes up to me for pets.$1",
                "Mon10": "You'll never leave me, will you?#$b#There's no one out there that's as crazy for you as I am, so be a good boy and stay with me forever.$4^There's no one out there that's as crazy for you as I am, so be a good girl and stay with me forever.$4",
                "Tue10": "Even once we live together, I could just walk into the bathroom when you're showering, but...#$b#I might still watch you on the camera sometimes.$4",
                "Wed10": "I wonder if Marnie and Lewis think they're being sly.#$b#Everyone knows they're fucking.$2#$b#Everyone better know WE'RE fucking since I refuse to let anyone else near you.$5",
                "Thu10": "I already have a good idea of where my room can go when I move in.$1",
                "Fri10": "I don't have any projects to work on today.$7#$b#Let's just spend the day in bed together. I know your bed has enough room for me.$4",
                "Sat10": "If anyone gives you any trouble, you know I can blackmail them for all they're worth, right?$7#$b#Just say the word, and I'll do it.$1",
                "Sun10": "We should get married.$4#$b#That way, everyone will know that I officially own you.$1",
                // SEASON & HEART-BASED DIALOGUE
                //summer
                "summer_Mon2": "Air-conditioning might be the greatest invention known to man.#$b#Well, second to computers, anyway.$7",
                "summer_Tue2": "I have no idea how you can work out in the heat all day.",
                "summer_Wed2": "Are your hands all calloused from working with all of your tools?#$b#I could get you some lotion.$7#$b#I always keep a bottle by my desk and another by my bed.$1",
                "summer_Thu2": "Sorry if Demetrius ever talks your ear off about your crops.$2#$b#He can talk forever. It's so annoying.$2",
                "summer_Fri2": "Since it's summer, it stays lighter for longer.#$b#I guess that doesn't matter when you live in a basement.$2",
                "summer_Sat2": "I don't like getting tan. I like how I look pale.#$b#Of course, I don't really tan. I just burn.$2",
                "summer_Sun2": "The sun's so bright, but I refuse to wear sunglasses.#2#$b#I look so stupid with them on.$2#$b#I bet you'd look good, though.$4",
                "summer_Mon4": "I hate working on my motorcycle when it's so hot and humid.$2#$b#I just feel so gross afterwards.$2",
                "summer_Tue4": "It's a good thing your house has air-conditioning so that you can cool down at the end of the day.$7",
                "summer_Wed4": "Use lots of sunblock so you don't burn and look like a crab person.",
                "summer_Thu4": "I get so thirsty in the summer.$2#$b#Do you think you could help with that?$4",
                "summer_Fri4": "Do you want some ice cream? I could always get you some.$7#$b#I'm sure I'll enjoy it just as much as you will.$4",
                "summer_Sat4": "If you get too hot, go sit in the shade and cool off.#$b#Whenever I have to go out in the sun, I try to stick to the shade as much as possible.",
                "summer_Sun4": "%As you wipe the sweat from your forehead, you notice Sebastian staring intently at you.#$b#%He seems to be watching your every move.",
                "summer_Mon6": "If you want to take a break when you're up in the mountains or mines, feel free to come relax here.$1",
                "summer_Tue6": "%Sebastian's eyes are fixed on you, only moving to watch a drop of sweat trail down your temple.",
                "summer_Wed6": "Make sure you're staying hydrated.#$b#If you pass out, there's no telling what someone might do to you while you're unconscious.$1",
                "summer_Thu6": "When I was smoking yesterday, the fattest frog I've ever seen hopped past me.$1#$b#I wish I could've caught him or gotten a picture or something.$2",
                "summer_Fri6": "Why can't summer be over already?$2#$b#If I had powers like that wizard, I'd get rid of summer completely.$2",
                "summer_Sat6": "I have a feeling that I could make you feel hotter than the sun does.$4",
                "summer_Sun6": "You take pretty long showers.#$b#I'm okay with that.$4",
                "summer_Mon8": "I think you can make good use of this.[SummerSquash]$1",
                "summer_Tue8": "Sweat's usually really gross, but on you, gem...$4#$b#%Sebastian licks his lips and grins.",
                "summer_Wed8": "Don't you think you'd enjoy showers more if I was there?$4",
                "summer_Thu8": "Sometimes, I think about just jumping into the water by my house when it's this hot.#$b#I'd love to see you in there.$4#$b#Maybe even struggling a little bit....$4",
                "summer_Fri8": "I don't want to hang out at the saloon.$2#$b#I can think of far better things to do with my time.$2#$b#I can think of SOMEONE to do, too.$4",
                "summer_Sat8": "Abigail started talking shit about you at the saloon last night.$5#$b#I made sure to shut that down immediately.$5",
                "summer_Sun8": "If you start feeling dizzy when you're working, take a break, okay?#$b#We don't need you cracking your pretty, little head open if you pass out, do we?$1",
                "summer_Mon10": "You look so cute when you come out of the mines covered in dirt and slime.$4#$b#It's pretty hot how you can kill monsters just like that.$4",
                "summer_Tue10": "How much longer are you going to make me wait to move in?$2#$b#What? You're making me wait until we get married?$5",
                "summer_Wed10": "You looked so cute tossing and turning in your sleep last night.$4#$b#If you're going to toss the blankets off like that, you should sleep naked.$4",
                "summer_Thu10": "We should live in that secret forest.#$b#You could clear out the monsters, and you could build us a house there.$1#$b#No one would be able to hear you scream when I'm fucking you so well.$4",
                "summer_Fri10": "It's a good thing that you're such an obedient boy.$4^It's a good thing that you're such an obedient little girl.$4#$b#I'd have to put you in a kennel otherwise.$1",
                "summer_Sat10": "If we moved to the city, you wouldn't have to spend so much time working and could spend more time with me.$2",
                "summer_Sun10": "We should get married.$4#$b#That way, everyone will know that I officially own you.$1",
                //fall
                "fall_Mon2": "The air's always so fresh in the fall.$7",
                "fall_Tue2": "Sometimes when I'm walking to the saloon on Fridays, I can smell cookies coming from Evelyn's.$7#$b#She's one person in town I'm okay with.$7",
                "fall_Wed2": "Alex tried talking to me the other day.#$b#I have no idea why or what about.#$b#I kind of just tuned him out and nodded every so often.#$b#He better not have been talking about you.$5",
                "fall_Thu2": "Today is practically the definition of sweater weather.$7",
                "fall_Fri2": "I've got three of this same hoodie so I can cycle through them.#$b#People think I just never change my clothes, though.$5",
                "fall_Sat2": "$y 'Did you ever make leaf piles to jump around in when you were a kid?$7_All of the time!_Let's make one together.$1_No. I never got the chance._Don't be sad. We can make one together.$1'",
                "fall_Sun2": "I'd love it if it was fall year round.$7",
                "fall_Mon4": "I think the red leaves look the best.$7#$b#The red on your cheeks looks way better, though.$4",
                "fall_Tue4": "I hate having to walk down the mountains, but I have to say... I love living in them.$7#$b#I get to see all of the trees from up high.$1",
                "fall_Wed4": "How do you always look so good?$4",
                "fall_Thu4": "Mushrooms look cool, but they taste so disgusting.$2",
                "fall_Fri4": "If you always come talk to me, I might start thinking that you've already accepted that I'm going to be your owner.$1",
                "fall_Sat4": "I wonder what you'd look like wearing one of my hoodies....$4#$b#Want to try one on?$1",
                "fall_Sun4": "None of the other guys have offered you their sweatshirts, have they?$5",
                "fall_Mon6": "Let's take a walk in the forest when you finish up with work.$7#$b#I can't promise that I'll be able to keep my hands to myself, though.$4",
                "fall_Tue6": "I'm glad that frogs still hang around in fall.$7#$b#I just love watching them so much.$1#$b#Of course, I like watching you the most.$4",
                "fall_Wed6": "You should let me choose an outfit out for you sometime.$7#$b#I know you've got plenty of cute clothes for fall.$4",
                "fall_Thu6": "I'm not a romance guy, but there's something sort of romantic about everything beginning to die in fall, isn't there?$7",
                "fall_Fri6": "You should probably clean your house soon.#$b#Don't forget that I can see everything, gem.$1",
                "fall_Sat6": "Make good use of this.$4[272]",
                "fall_Sun6": "Are you growing any pumpkins this year?$7#$b#If you are, be a good boy and make me some pumpkin soup.$4^If you are, be a good girl and make me some pumpkin soup.$4",
                "fall_Mon8": "I would've helped you when you slipped in the leaves and fell on your hand and knees last night...#$b#...but I didn't trust myself not to take advantage of that position.$7",
                "fall_Tue8": "Riding my motorcycle in fall is the greatest.$7#$b#The crisp air blowing my hair everywhere feels so good.$1#$b#I bet I could make you feel just as good.$4",
                "fall_Wed8": "Skip work for today and hang out with me instead.$7#$b#That's an order, not a suggestion.",
                "fall_Thu8": "I got this for you.[191]$4#$e#I wonder what you'd look like with it around your pretty, little neck.$4",
                "fall_Fri8": "I'd love to see you lying naked in a pile of leaves.$4#$b#Your skin would look great against all of the different colors.$4",
                "fall_Sat8": "Would you ever consider letting me choke you with your scarf?$4#$b#If not, I have something else you can choke on.$4",
                "fall_Sun8": "If I see you almost hurt yourself one more time, I'm locking you up forever.$5#$b#The only thing that's allowed to scratch or bruise you is me.$5",
                "fall_Mon10": "You know how people make scrapbooks with leaves and flowers they find?#$b#I kind of want to start a scrapbook with the little things of yours I've collected.$4",
                "fall_Tue10": "If it's clear out tonight, we should look at the stars together.#$b#Of course, I probably won't be looking at the stars when I've got you beside me.$4",
                "fall_Wed10": "I was out late and found this. I figured you'd like it.[84]$1",
                "fall_Thu10": "I think your farm could use more decorations.$7#$b#Make it as cute as you are, gem.$4",
                "fall_Fri10": "I'll stop by later.#$b#Make sure you're ready for me.$4",
                "fall_Sat10": "I know this jar is labeled mayonnaise, but I can tell you right now that it's not mayonnaise.$1[306]",
                "fall_Sun10": "We should get married.$4#$b#That way, everyone will know that I officially own you.$1",
                //winter
                "winter_Mon2": "Nothing really grows in winter, does it?",
                "winter_Tue2": "Your nose is all red.#$b#How cute.$1#$b#Do you need me to warm you up?$4",
                "winter_Wed2": "$y 'Did you ever go sledding as a kid?_Yeah! I wish I could go sledding now!_There are plenty of places in the valley to sled. Let's do it sometime.$1_No. There was nowhere I could in the city._Well, there are plenty of places in the valley to sled. Let's do it sometime.$1'",
                "winter_Thu2": "Do you get bored in the winter with less work to do?#$b#Stop by my room, and I'll entertain you.$4",
                "winter_Fri2": "Every time it snows a lot, it makes me think of this time when I was a kid.#$b#It snowed so much that we actually got snowed in.#$7#That gave me an excuse to not leave the house.$1",
                "winter_Sat2": "I found this growing by my usual smoking spot and thought you might want it.$7[414]",
                "winter_Sun2": "$y 'What's your favorite color?_Red._Oh? I have just the thing for you.[64]_Blue._Oh? I have just the thing for you.[62]_Green._Oh? I have just the thing for you.[70]'",
                "winter_Mon4": "You look beautiful with snow in your hair.$4",
                "winter_Tue4": "$y 'Do you like winter, gem?_Yeah! It's really pretty._Just like you.$4_No. It's way too cold._Then I'll warm you up. Come here.$4'",
                "winter_Wed4": "With less to do on the farm, you have more time to visit me.$7#$b#You better start coming over more.$2",
                "winter_Thu4": "Being able to pelt trees with snowballs is a great way to relieve my anger when it becomes too much.",
                "winter_Fri4": "Would a hug help warm you up?$4#$b#I know it'd warm me up.$4",
                "winter_Sat4": "Be careful not to get frostbite or hypothermia, gem.$1#$b#You'd have to spend a bunch of time with Harvey then....$2",
                "winter_Sun4": "Sam and I ended up having a snowball fight last night.$7#$b#He kept making jokes about his balls, though.$2#$b#I told him that if he kept it up, I'd push him down and suck them.$7#$b#Wouldn't be the first time.$1",
                "winter_Mon6": "I like that you spend more time inside in the winter.$7#$b#I get to watch you even more than before.$4",
                "winter_Tue6": "Your cheeks are always so red from the cold when you visit me.$7#$b#How about you let me make them red for a different reason?$4",
                "winter_Wed6": "If you borrow a sweater from another guy, I'll take it and burn it.$5#$b#Good luck coming up with an excuse for why it's a pile of ashes if that happens.$1",
                "winter_Thu6": "You must be pretty flexible with how you squeeze your way around rocks in the mines.$7#$b#You should prove me right, gem.$4",
                "winter_Fri6": "I better be the only guy you visit this often.$5",
                "winter_Sat6": "If you get too close to any other guys, it'll be hard to keep myself from throwing snowballs at them.$5#$b#Maybe even ice chunks....$5",
                "winter_Sun6": "If you're cold, I can warm you up inside and out.$4",
                "winter_Mon8": "Have you ever touched yourself to the thought of me, gem?$4#$b#If you have, I haven't seen it yet.$2",
                "winter_Tue8": "Blowing on your hands to warm them up makes them colder.#$b#Condensation from your breath evaporates and makes them colder.#$b#I've got something better you could blow.$4",
                "winter_Wed8": "If you get too cold at night, I'm just a message away, gem.#$b#I'll come over right away and make you nice and warm.$4",
                "winter_Thu8": "Today's way too cold for you to be outside working.$2#$b#Let's play video games.$1#$b#Of course, we could always play with each other instead.$4",
                "winter_Fri8": "$y 'Have you ever tried to catch a snowflake on your tongue?_Yep!_I have something else you could catch on your tongue.$4_Nope!_Oh? Then I've got something else you could try to catch on your tongue.$4'",
                "winter_Sat8": "You never notice when I'm on your farm, do you?$7#$b#The snow deafens everything.$1",
                "winter_Sun8": "You should just let me move in already.$1#$b#We both know where this thing between us is going.$4",
                "winter_Mon10": "Never forget that you belong to me.$4#$b#I own you.$4",
                "winter_Tue10": "Every once in a while, I forget that it's almost the end of the year.#$b#Speaking of the ends of things, I think you'd look great at the end of a leash, gem.$4",
                "winter_Wed10": "Haven't you gotten a mermaid pendant yet?$2#$b#I'm running out of patience.$5",
                "winter_Thu10": "Why just warm up after being in the cold?#$b#Why not let me make you hot and bothered instead?$1",
                "winter_Fri10": "When spring comes around, are you going to plant flowers?#$b#You always look so cute tending to them, gem.",
                "winter_Sat10": "Will you let me lay you down on the kitchen table tonight and fuck you until you can't walk?$4",
                "winter_Sun10": "We should get married.$4#$b#That way, everyone will know that I officially own you.$1",
                
                // Birthday Dialogue
                "winter2_10": "The fact that you even remembered that it's my birthday today is a present in and of itself.$1",
                "winter4_10": "I'm glad I take up enough space in your mind for you to remember my birthday.$7",
                "winter6_10": "You don't have to get me anything for my birthday.#$b#Seeing my gem in person rather than on my computer screen is enough for me.$4",
                "winter8_10": "Are you going to give yourself to me for my birthday?$4#$b#There's nothing I want more than you.$4",
                "winter10_10": "I want you on your back with your legs spread for me for my present today.$4#$b#You wouldn't say no to the birthday boy, would you?$1",

                // Location 
                "Mountain_47_23": "There's only one thing that I'd ever give up smoking for.#$b#What is it? Use that brain of yours and take a guess.$1",
                "summer_Mountain_58_35": "If you see any frogs around, let me know.$7",

                // specific dates
                "spring_12": "Great, yet another year of watching Abigail run around and make a fool of herself at the Egg Festival.$2",
                "spring_23": "I don't understand how anyone can actually enjoy dancing.$2#$b#I'd rather get a tooth pulled than take part in the Flower Dance, but I'm forced into it every year.$5",
                "spring4_23": "You're dancing with me tomorrow. Got it?#$b#If you don't, Abigail will make me dance with her like she does every other time.$5",
                "summer_10": "Sam told me his plans for the soup this year.$7#$b#I don't think there's anything you'll be able to put in there to save it.$7",
                "summer_27": "The migration of the moonlight jellies is one of the only reasons I ever go to the beach.",
                "fall_20": "I always keep an eye out for frogs in fall.$7#$b#While other reptiles and amphibians start hibernating around now, frogs keep hopping around for a little longer.$1",
                "fall_26": "Tomorrow, I can walk around in the dark without anyone thinking I'm up to something.$7",
                "winter_7": "I feel like I'm going blind every time I go to the Festival of Ice.$2#$b#The sun reflecting off of the ice feels bright enough to burn my eyes out of my head.$2",
                "winter_24": "I really don't want to receive some random junk tomorrow.$2#$b#The only person I'd actually want a present from is you.$7"
            }
        }
    ]
}