// Beefy part of the mod
// Why are you looking here? Horny or smthn? ;)

{
  "Changes": [
      {
        "LogName": "Sam's Unmarried Dialogue",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Sam",
        "Entries": {
          "Introduction": "Oh hey, you must be the new farmer!$h#$b#Hell, if I had known you were gonna be this cute, I would've worn something better...$10'",
          // GENERIC DIALOGUE 
          "Mon": "Oh, hey farmer.$h#$b#I always have time to talk to someone as cute as you.$3",
          "Tue": "Hey, how's that farm coming along?#$b#I'd love to see it one of these days... $3",
          "Wed": "@!$h#$b#I was hoping I'd get to see you today.#$b#Looks like you're just as eager to talk to me too, huh?$3",
          "Thu": "You should totally come watch me play guitar sometime.#$b#I'm actually pretty good, enough to serenade a pretty guy like you at least...$3^I'm actually pretty good, enough to serenade a pretty girl like you at least...$3",
          "Fri": "I'd really love to get to know you more, the mysterious farmer.#$b#I can tell we'll be really good friends... maybe even something more...$3",
          "Sat": "Hey, never too busy for you.$3#$b#What's up?$0",
          "Sun": "You know if you ever need a break from the farm...#$b#I'll always be down to play a round of pool with you at the saloon... #$b#$hCan't promise I'm any good though.$2",
          // HEART-BASED DIALOGUE
          "Mon2": "Since there's not a lot of other kids here, I end up playing with Vincent a lot.#$b#I wonder if he'll miss me when I move into your place...$9#$b#Whoa, sorry. Too soon to profess my love?$h",
          "Tue2": "Hey baby- $h#$b#I mean farmer... $8#$b#Heh, sorry, been daydreaming too much lately...$10",
          "Wed2": "$y 'Hey, who was your first kiss with?_No one, yet_Oh, really? Good to know_Some random from the city..._Oh...Do you happen to know where they live?$5'",
          "Thu2": "Are you ever tired from working on the farm?$9#$b#Well, if you are, you can always use my bed to rest...$3",
          "Fri2": "@!$h#$b#I swear, I'll never get bored of seeing you.$3#$b#You should come around more often, I get bored of only watching you on your farm... $2#$b#How would I know that? I- I um....$8",
          "Sat2": "%You see Sam fiddling around with something... Looks like a tiny camera...",
          "Sun2": "What's up, farmer?$h#$b#I'm trying to figure out who's the cutest, you or a kitten... $2#$e#It's for uh... scientific purposes.$10",
          "Mon4": "You've been giving me a lot of gifts lately, you're trying to romance me, aren't you?$10#$b#Don't worry, even if you aren't, I'll still make you mine...$l",
          "Tue4": "...$2#$e#Oh, hey @.$3#$b#Sorry, Just thinking about yo- I mean something...$h",
          "Wed4": "Ugh, I have to work today... $2#$b#Means I won't be able to stalk-#$b#I mean!$8#$b#Hang out with you...$3",
          "Thu4": "Hmm, I'm thinking about writing a song... #$b#I know it's soon, but could I use you as my muse?$10",
          "Fri4": "I had a nightmare about you last night... $2#$b#I was afraid I'd never see you again...$9",
          "Sat4": "You were tossing around a lot in your sleep last night...$9#$b#Are you feeling alright?$7#$b#What? You should know by now I'm a little obsessed with you...$3",
          "Sun4": "What's up, @?$h#$b#You look amazing today...$l#$b#I wonder if it's because you're in love with me...$3#$b#No? Are you sure?$l",
          "Mon6": "Hey pretty thing, how goes the farm?$3#$b#Made any more room for me in that house yet?$h",
          "Tue6": "%Sam is looking at you with longing in his eyes... #$b#When will you be mine already?$2",
          "Wed6": "I want to touch you everytime I see you... $3#$b#You're irresistable.$l",
          "Thu6": "God, you look so good right now...$l#$b#I bet you'd look even better with my hand wrapped around that pretty little neck of yours...$3",
          "Fri6": "You shouldn't go too far into the mines... $9#$b#You might hurt yourself... $9#$b#I don't know what I'd do without you...$2",
          "Sat6": "Darling, are you taking enough breaks?$3#$b#Working on a farm must be so exhausting...$2#$b#I don't know what I'd do if I saw you other than healthy...#5",
          "Sun6": "I want to give you a kiss, can I?$4#$b#Not yet?$5",
          "Mon8": "Hey baby, how are you?$h#$b#%You see a photograph fall out of Sam's pocket.#$b#Oh, um... I can explain that...$8",
          "Tue8": "I'm the only one you have eyes for, right?$h#$b#If not, I'll just have to make sure you remember who you belong to...$3",
          "Wed8": "I just wanna lock you up and keep anyone from seeing you.$l#$b#Actually, that's not a bad idea...$h",
          "Thu8": "We should go on a date one of these days...#$b#Or maybe we could just go back to your place and uh... Y'know...$10",
          "Fri8": "Do you think I could have something of yours?$10#$b#Maybe a bouquet or... undies...?$3",
          "Sat8": "I wish you could stay with me all the time... $2#$b#I just love the way your voice sounds...$l",
          "Sun8": "Sometimes I just really wanna hold you.$4#$b#Not in a nasty way, I just think you'd look cute with me wrapped around you.$3",
  
          // SEASON & HEART-BASED DIALOGUE
          //summer
          "summer_Mon2": "You look exhausted, is it the heat?$8#$b#You're more than welcome to take a break in my room if you'd like...$10",
          "summer_Tue2": "Hey, @.$3#$b#Wanna get some ice cream? My treat.$h#$b#No, I'm not just trying to see what you look like when you lick something.$5#$b#Though, that's not a bad idea...$3",
          "summer_Wed2": "I think I'm going crazy.$2#$b#All I can ever think about lately is you and we barely even know each other...$10",
          "summer_Thu2": "Your face is flushed...$8#$b#Is it because of the heat or are you just shy being around me?$10#$b#Come on, you can tell me.$3",
          "summer_Fri2": "Let's go to the beach later, I'll bring snacks and an umbrella.$h#$b#Fine, you caught me, I really just want to spend time with you and make you smile...$10",
          "summer_Sat2": "What's up, farmer?$h#$b#You look a little flushed, you should come cool off on my bed- I mean room for a bit.$3",
          "summer_Sun2": "Hey, @.$h#$b#Oh my, your face is really red from the heat. $7#$b#It's actually really cute.$l",
          "summer_Mon4": "Ugh, I wish I didn't have to work today.$5#$b#We should get married already so I can be your hot trophy husband...$h",
          "summer_Tue4": "You know I never thought I was a jealous type...$2#$b#Until I saw you talking to someone else earlier...$5",
          "summer_Wed4": "@!$h#$b#I'm so glad you're here, I'll always make time for you.$3#$b#So, what's up?",
          "summer_Thu4": "Hey, don't talk to anyone else today.$5#$e#I want to be the first and last person you talk to everyday...$3",
          "summer_Fri4": "We should go to the beach this weekend, just you and me.#$b#Make sure to wear a tiny little bathing suit...$h#$b#I'll be sure no one else is around to look at you...$3",
          "summer_Sat4": "I'm gonna make you love me one of these days...$l#$b#I'll even tie you up and never let you leave if I have to.$3",
          "summer_Sun4": "Am I too much for you?$2#$b#Sorry, it's just every thought I have has been about you...$9#$b#How do you do that? Just get in my head and make it your own?$5",
          "summer_Mon6": "I noticed your face has been super red lately...$7#$b#Are you putting on enough sunscreen?$9#$b#I'll definitely wouldn't mind helping you apply some...$10",
          "summer_Tue6": "Your underwear drawer's been short lately?$8#$b#I mean... I DEFINITELY don't know where they could've gone...$10#$b#I could buy you some more if you'd like though...$3",
          "summer_Wed6": "%You catch sam staring at you with an intoxicated grin.#$b#%He doesn't look away this time, almost like he's challenging you.",
          "summer_Thu6": "Wanna hang out in my room today?$h#$b#I know it's super hot working on that farm and you look like you could use a break.$3",
          "summer_Fri6": "Turn around, I want to give something to you.$3#$b#%Sam hugs you from behind and whispers in your ear...#$b#%'I love you more than you know, even if you can't say it back yet...'",
          "summer_Sat6": "You look really cute with your cheeks all flushed from the heat like that...$l#$b#I wonder if they'd look the same if I hmmm...$h#$b#I'll tell you another day$3",
          "summer_Sun6": "I just want you to be mine...$9#$b#When will you finally give in?$2",
          "summer_Mon8": "Hey, @.$h#$b#You know you're a really good muse...$10#$b#Everytime I see you, all I can think of are song lyrics...$10#$b#Mostly ones about all the things I'd do to you if you let me...$l",
          "summer_Tue8": "I'm starting to hate summer...$2#$b#I know it's hot but I can't stand the thought of other guys looking at you all sweaty...$5",
          "summer_Wed8": "Hey sexy farmer.$3#$b#You know, when you look like that...#$b#It's like I fall in love with you all over again...$l",
          "summer_Thu8": "Hmm, I wonder what I have to do to get a kiss from you today...$h",
          "summer_Fri8": "Can I ask you a question, @?$3#$b#If I learned how to grow crops like you, do you think I could help you out on the farm sometime? Maybe forever...$10",
          "summer_Sat8": "We should go on a date one of these days...$3#$b#I'll show you just how much boyfriend material I am...$h#$b#Y'know, other than the fact that I'm completely head over heels for you already...$10",
          "summer_Sun8": "Aren't you hot wearing that?$8#$b#You should totally strip down...$h#$b#Don't worry, I'll cover you so no one else sees...$3",
  
          // BIRTHDAY-SPECIFIC
          "summer2_17": "Hey farmer!$h#$b#Thanks for coming on my birthday.$3#$b#Even if you didn't get me a gift, talking to you is enough.$10",
          "summer4_17": "Hey, @!$h#$b#I know we're not dating yet but since it's my birthday, do you think I could get a kiss?$10",
          "summer6_17": "I can't believe you came!$h#$b#There's nothing I wished more than to talk to you on my birthday...$3#$b#Please tell me the gift you got me includes you without clothes...$l#$b#Aww, really?$2",
          "summer8_17": "Hey baby, you know you don't have to get me a gift today, right?...$3#$b#I'm perfectly fine with just you naked on my bed...$l",
          "summer10_17": "Hey sexy farmer, since it's my birthday today...$h#$b#You'll let me do anything I want, right?$3",
  
          //fall
          "fall_Mon2": "Hey Farmer, it's pretty chilly today, isn't it?#$b#Make sure you bundle up, I don't want you getting sick.$3",
          "fall_Tue2": "%Sam can't hear you, he has his headphones in.",
          "fall_Wed2": "I think Fall might be my new favorite season...#$b#You look amazing in this weather...$3",
          "fall_Thu2": "$y 'Do you have a favorite type of fall flower?_Yeah, I like sunflowers_Oh awesome, I guessed right. Here, for you.[421]_Yeah I like fairy roses_Oh awesome, I guessed right. Here, for you.[595]'",
          "fall_Fri2": "What's up, @?$h#$b#You know I always have time to talk to you.$3",
          "fall_Sat2": "Have you tried Joja Cola yet?#$b#It's honestly one of my favorite drinks...$3#$b#Here, I thought we could split one.[167]$h",
          "fall_Sun2": "I wonder what you'd feel like in my arms...$h#$b#What? It's cold outside and thought you'd wanna warm up...$10",
          "fall_Mon4": "You look really good in fall attire...$3#$b#I wonder what you'd look like wearing nothing...$h",
          "fall_Tue4": "I really want us to grow closer.$9#$b#I can't stop thinking about you, it's almost consuming.$2",
          "fall_Wed4": "Our heater hasn't been working lately...$9#$b#Do you think I can come over sometime?$10#$b#Y'know, because I'm soooo cold and am not interested in knowing what your room looks like at all...$3",
          "fall_Thu4": "It's a little chilly out today, do you wanna borrow one of my hoodies?#$b#The only thing I ask in return is that you don't wash it when you give it back.$3",
          "fall_Fri4": "Do you think I'd look good in overalls?$h#$b#I think I might give the 'farmer' thing a shot...$10",
          "fall_Sat4": "You have a leaf in your hair, let me get it for you.$3#$b#There, now you're perfect.$h",
          "fall_Sun4": "Hey, @.$h#$b#Huh?$9#$b#...$9#$b#OH! Sorry, that's just um...$8#$b#fake blood!$3#$b#What was I doing? I was messing around with umm...$8#$b#Vincent and our Spirit's Eve Costumes...$h",
          "fall_Mon6": "You aren't talking to anyone else, are you?$2#$b#I don't think I could stand sharing you.$9",
          "fall_Tue6": "%Sam's busy writing on a notepad...#$b#%You catch a glipse of him writing '@'s favorite things'...",
          "fall_Wed6": "I'm really happy you decided to move here.$h#$b#Now, you won't be able to get rid of me.$3#$b#I'm completely head over heels for you.$l",
          "fall_Thu6": "You're really fun to stal-$3#$b#I mean watch...$8#$b#You're just so beautiful I never want to look away...$l",
          "fall_Fri6": "I've been writing a song about you lately.$3#$b#I hope that's alright, you're just an amazing muse...$l",
          "fall_Sat6": "You should take the day off.$3#$b#I really hate seeing you wear yourself out.$2#$b#Or maybe I can just follow you around all day and help you out...$h",
          "fall_Sun6": "I'm really starting to get impatient.$2#$b#I want everyone to know you're mine already.$9",
          "fall_Mon8": "Can I tell you a secret?$h#$b#I love you and I never want you to leave...$l",
          "fall_Tue8": "@!$h#$b#Did you see my text last night?$3#$b#No?$9#$b#Well, I was wondering if you could come over later.$10#$b#I got a new movie I thought you'd enjoy watching with me.$h",
          "fall_Wed8": "You keep getting leaves in your hair lately.$9#$b#It's like you want me to constantly touch your hair.$3#$b#Do you?$10",
          "fall_Thu8": "Hey baby, wanna come over tonight?$l#$b#I already got a couple ideas on what we could do together...$10",
          "fall_Fri8": "Is it too soon to say I'd let you do anything to me?$10#$b#I'd love to see what ideas you can come up with...$l",
          "fall_Sat8": "Oh, hey @.$3#$b#I was wondering if you could say my name real quick?$h#$b#It's for uh... research purposes...$10",
          "fall_Sun8": "Whenever I'm with you, my heart pounds straight through my chest.$10#$b#Can you hear it?$3",
          //winter
          "winter_Mon2": "Your nose is a little red from the cold, it's cute.$3",
          "winter_Tue2": "Winter means less time on the farm, right?$h#$b#Does that mean you'll come see me more often?$10",
          "winter_Wed2": "It's so cold today, I wish I didn't have to go to work.$2#$b#How are you though?$3",
          "winter_Thu2": "It's already Winter and I barely know you...$2#$b#I might make it my New Year's resolution to get to know the mysterious farmer more...$10",
          "winter_Fri2": "...$l#$b#Has anyone ever told you how beautiful you are?$l#$b#It really makes me want to get to know you more...$10",
          "winter_Sat2": "Are your hands cold?#$b#Lucky for you, I specialize in warming hands.$h#$b#Here, let me grab them.$3",
          "winter_Sun2": "%You catch Sam staring at you.#$b#%He looks away, blushing.#$b#%Maybe it's just the cold making his cheeks red like that...",
          "winter_Mon4": "Ugh what I wouldn't give to skip work and hang out with you...$2",
          "winter_Tue4": "Are you cold? Do you want to borrow my jacket?$8#$b#You don't have to return it...$3#$b#It'd mean the world to me if you kept something I gave you...$10",
          "winter_Wed4": "What do you even do during the Winter?$2#$b#Do you fish? Mine?$9#$b#You should invite me to join you one of these days...$3",
          "winter_Thu4": "...$l#$b#Sorry, I just love looking at you.$10",
          "winter_Fri4": "You look really good today, did you do something different?$h",
          "winter_Sat4": "Remind me to swing by your place later.#$b#I gotta make sure you're safe and no creeps are lurking around...$10#$b#Your property is way too huge to manage by yourself...$3",
          "winter_Sun4": "Now that it's Winter and you're fishing more often, do you think I could join you sometime?$10",
          "winter_Mon6": "Hey, @!$h#$b#I'd love to hang out with you after work today.$3#$b#Will you wait for me?$h",
          "winter_Tue6": "Aren't you cold wearing that? Do you want my hoodie?$8#$b#I think you'd actually look really good wearing my clothes...$10",
          "winter_Wed6": "%You catch Sam whispering to himself...#$b#I need to change the view of this one camera, I can barely see their bed...$5",
          "winter_Thu6": "You look beautiful with a little snow in your hair.#$b#Can I touch it?$l",
          "winter_Fri6": "Do you want to go up to the bathhouse with me sometime?$h#$b#I hear it's great for warming farmers up...$3",
          "winter_Sat6": "I saw this earlier and it reminded me of you.[418]$3#$b#Do you like it?$h",
          "winter_Sun6": "@!$h#$b#I've been thinking about you so much lately.$3#$e#Are you casting some sort of smell on me?$3#$b#Don't worry, I wouldn't mind if you did...$h",
          "winter_Mon8": "$y 'I'm the only guy you visit this often, right?_Of course_Good girl^Good boy.$3_No..._Oh... I might have to do something about that...$9'",
          "winter_Tue8": "You know, now that it's winter, you should be spending more time with me$3#$b#I have a nice warm spot we could hang out, it may or may not be my bed...$10",
          "winter_Wed8": "Hey pretty farmer, feeling cold?$h#$b#Wanna play catch to warm you up? You run, and I'll catch you.$3",
          "winter_Thu8": "Do you want me like I want you, @?$2#$b#God, I hope you do... That'd be perfect...$3",
          "winter_Fri8": "I wonder just how cold your lips are from being outside...#$b#Do you think I could check using my own lips real quick?$3",
          "winter_Sat8": "'Your beauty is ineffable, therefore I have no words to convey your magical charm.'$6#$b#Did you like that? It took me an entire week to write that about you.$h",
          "winter_Sun8": "Can I hold you to warm myself up?$3#$b#I promise I'll keep my hands where you can see them...$10"
        }
      },
  
  
      // MISC SPECIAL DIALOGUE
      {
        "LogName": "Sam's Special Dialogue",
        "Action": "EditData",
        "Target": "Characters/Dialogue/Sam",
        "Entries": {
          // ~Special~
          "give_flowersA": "What are these?$9#$b#You're asking me to date you?$h#$b#Baby... You're already mine...$3",
          "give_flowersB": "How silly, you think flowers are what makes us official?$h#$b#You're about to get one hell of a news flash...$3",
          "give_pendant": "You're finally letting me have unlimited access to your room? Am I dreaming?$8#$b#I'll go talk to the mayor right now... The wedding's in three days.$l#$b#What? I'm setting it up too soon?$9#$b#Nothing's gonna stop me from officially making you mine, now that you've given me permission...$3",
          "SpouseStardrop": "It took me so long to find this...$3#$b#I ran around for weeks just trying to find something that was even close to your beauty...$h#$b#Now will you get back in bed?$l#$b#I didn't give you all that new energy for nothing...$l",
          "dating_Sam": "So, will you finally let me kiss you?$l",

          // Rejections
          "reject_two_heartA": "As much as I love seeing you beg...$3#$b#I have to say no. I need a few more weeks of stalki-I mean getting to know you...$h",
          "reject_four_heartA": "Trying to make me your boyfriend so early?$h#$b#Sorry, I want to see you suffer for a few more weeks first.$3",
          "engageA": "Don't tempt me like that...$5",
          "marriedA": "See? I told you I'd be the only one you'd think about.$3#$b#Now divorce %spouse first.$3",
          "refusal_no_heartsA": "Want to be mine already?$h#$b#Sorry, I barely know you...$10",
          "refusal_knownA": "%Sam looks at the bouquet longingly...#$b#You know I want to accept that but can't yet...$2",
          "refusal_botherA": "Please baby, stop playing with my heart.$2#$b#What I said before still applies.$9",
          "reject_two_heartB": "Maybe if you get down on your knees I'll agree...$3#$b#But I'm having so much fun stalkin- I mean getting to know you...$10#$b#Maybe next time...$3",
          "reject_four_heartB": "Not yet darling...$3#$b#I won't agree until I see your body begging for me...$3",
          "engageB": "Darling, quit playing with my feelings like this...$9",
          "marriedB": "Christ, darling...$9#$b#You can't play with me like this. Divorce %spouse first...$2",
          "refusal_no_heartsB": "Wow, you're beautiful when you're begging for my love.$3#$b#Sorry, I want to know you a little more.$10",
          "refusal_knownB": "Wait for me a little longer baby, I can't accept this quiet yet.$2",
          "refusal_botherB": "I said wait a little longer, don't make me tie you up until I'm ready...$5",
          "danceRejection": "No, I told you, you've been teasing me too much.$3#$b#I want to see you suffer the way you've made me...$3",
          "divorced": "%Sam looks at you with longing in his eyes.#$b#Go away before I make you regret divorcing me.$5",
          "dumped_Guys": "You think a little rejection will stop me?$9#$b#Do you forget who owns you?$3",
          "secondChance_Guys": "That's what I thought...$3#$b#You know you like it best when you're with me.$h",

          // Location Based
          "Saloon": "Oh hey farmer!$3#$b#You should join us this next round of pool, I'll make sure Sebastian goes easy on you.$h",
          "Saloon4": "Hey @!$h#$b#I feel like I'll make every shot now that you're here.$h",
          "Saloon6": "Jesus... $8#$b#I might have to throw you over this pool table right now if you keep looking like that... $l#$e#What? I have to show everyone that you're gonna be mine...$10",
          "Saloon8": "Hold on... I'm taking you home right now... $3#$b#What? You can't look that beautiful for everyone else to see. $5#$b#That body is for my eyes only.$3",
          "Saloon10": "Have I ever told you how stunning you are?$10#$b#I'll stop playing right now if you let me take you home...$10",
          "SamHouse": "Coming to see me in my own house?$3#$b#Maybe I should pick up on the flirting.$h",
          "SamHouse2": "With how much you're coming here to talk to me, I'd think you're starting to like me... $10#$b#Hold on, you have something in your hair.$3#$b#An excuse to touch you?$8#$b#I don't know what you're talking about.$10",
          "SamHouse4": "You should be careful talking to me in here, there's nothing much stopping me from escalating this...$3",
          "SamHouse6": "Coming in here to talk to me? Looking like that?$10#$b#I might just make you mine right now.$10#$e#%You notice one of your lost underwear on Sam's bed.$e#Um... That's uh... $8#$b#Just pretend you don't see that...$3#$b#What? Like you're any better, you're practically knocking down my door to talk to me.$5",
          "SamHouse8": "What I wouldn't give to throw you on my bed right now...$l#$b#My family will hear? I'll just close the door...$3",
          "SamHouse14": "Hey baby... $3#$b#I know you miss me but don't worry, I'll be home later to give you that attention you so crave...$h",

          // Day before Holidays (Unmarried)
          "spring_12": "Aww, you're so cute.$h#$b#You get excited for the egg festival the same way my brother does.$3",
          "spring_23": "Ugh, I wish I didn't have to work tomorrow so I could enjoy the flower dance.$2",
          "spring4_23": "Ugh, I wish I didn't have to work tomorrow so I could enjoy the flower dance.$2#$b#Speaking of, you're gonna ask me to dance with you, right?$h",
          "summer_10": "I don't have to work tomorrow! I've never been so happy.$h#$b#Do you wanna hang out by chance?$10",
          "fall_26": "Are you excited for the haunted maze tomorrow?#$b#I've been a few times and could show you some hidden spots for us to make out in...$10",
          "winter_24": "I can't tell you if I'm your 'secret friend' or not but I wanted to give you this before the festival tomorrow.$3#$b#I wanted to be the only one to see your reaction.[74]$l",

          // Flower Dance Accepted/Declined
          "FlowerDance_Accept": "I knew you'd pick me.$3",
          "FlowerDance_Accept_Spouse": "Get ready for me to sweep you off your feet, because we're definitely continuing this at home later...$l",
          "FlowerDance_Decline": "I told you, you've been teasing me wayy too much. I wanna see you suffer today.$5"
        }
      },
  

      // MARRIAGE DIALOGUE
      {
        "LogName": "Sam's Married Dialogue",
        "Action": "EditData",
        "Target": "Characters/Dialogue/MarriageDialogueSam",
        "Entries": {
          "Rainy_Day_0": "I love watching you work on the farm when it's raining...$h#$b#When your clothes are wet I can see right through them...$l",
          "Rainy_Day_1": "Since it's raining, you should stay home today.$3#$b#I get to be as loud as I want with you without anyone hearing...$3",
          "Rainy_Day_2": "Hey sexy farmer...$3#$b#It's raining... you know what that means?$h#$b#What? You have stuff to do?$9#$b#UGH, at least save your energy for me later...$5",
          "Rainy_Day_3": "Hey, do me a favor and don't dry off when you come back in later...$3#$b#I want a few pictures of you drenched...$3",
          "Rainy_Day_4": "I'm already getting turned on watching you work on the farm while it's raining...$l#$b#I'm gonna need a cold shower if I'm gonna make it the whole day without you...$10",
          "Rainy_Night_0": "You look beautiful with rain drops still in your hair...$l#$b#Is it alright if I kiss you?$l",
          "Rainy_Night_1": "There's some mud still on your legs...$8#$b#Here, let me take your pants off...$3#$b#Maybe I'll just tear off those panties as well...$l",
          "Rainy_Night_2": "Oh wow... Turn around...$l#$b#I wanna see how your wet clothes frame your body up close...$l",
          "Rainy_Night_3": "Aww, your clothes are all wet...$9#$b#You should definitely take them all off in front of me...$h",
          "Rainy_Night_4": "Wow, if that's what you look like when you're all wet...$10#b#Here, come take a hot shower with me, I know you're cold.$3",
          "Indoor_Day_0": "Hey, you know that thing you did last night?#$b#Do it more often, I'm getting hard just thinking about it again...$3",
          "Indoor_Day_1": "Don't leave for so long again today...$2#$b#I need you so bad I can't stop thinking about you...$9",
          "Indoor_Day_2": "$y 'Hey darling, eat breakfast with me?_Of course!_Oh, awesome. Here, I thought you'd say yes.[211]$h_No thank you._Aww... Alright.$2'",
          "Indoor_Day_3": "Even half-awake, you look amazing.$3",
          "Indoor_Day_4": "I dreamt about you again last night...#$b#Even when I'm asleep, all I can think about is you.$h#$b#Finish early today, I don't know if I can be away from you for too long again...$10",
          "Indoor_Night_0": "Finally... $h#$b#Welcome home.$3#$e#How was your day?$3#$b#Here, let me help you take off those clothes while you tell me all about it...$h",
          "Indoor_Night_1": "Hey @, it's about time you came home, I was getting worried about you.$3#$b#Don't leave for so long again...$2",
          "Indoor_Night_2": "...$l#$b#Sorry, you just look so beautiful when you come home from working...$10",
          "Indoor_Night_3": "Welcome home, baby.$h#$b#I was trying to get some cleaning done today, but I couldn't stop worrying about you...$2#$b#You were safe today, right?$9",
          "Indoor_Night_4": "$y 'I couldn't stop thinking about if you'd still love me when we're old..._Of course I would!_You would? I guess I don't have to bring out those cuffs as soon as I thought... Unless...$l_I don't think I would..._You wouldn't? No matter, I'll chain you up so you won't leave anyway.$3",
          "Outdoor_0": "Hey baby, hold my hand real quick.$h#$b#Sorry, I just wanted to touch you again before you left...$3",
          "Outdoor_1": "You might want to save some energy for what I have planned tonight.$3#$b#No, I won't tell you what it is.$3",
          "Outdoor_2": "Those bruises look so much better on you in daylight...$l#$b#I might just leave a few more tonight.$3",
          "Outdoor_3": "Make sure you give me a kiss before you leave.$h#$b#I don't know what I'd do if I had to wait all day for one.$9",
          "Outdoor_4": "I hope you're happy with me here, because to me, you're my entire world.$l#$b#I don't know what I'd do without you.$10",
          "patio_Sam": "Hey, want me to teach you some skateboarding tricks?$h#$b#Don't worry, I'll be sure to catch you when you fall.$3",
          "OneKid_0": "Now that I've given you a kid, you'll still give me the same attention, right?$h#$b#What am I kidding, I'll force that attention out of you.$3",
          "OneKid_1": "Hey baby, I was thinking about taking %kid1 to the park later.#$b#Do you wanna join?$h",
          "OneKid_2": "It makes me so happy when I look %kid1.#$b#It reminds me of all the times I came in you...$l#$e#Maybe we should have enother kid.$h",
          "TwoKids_0": "We should let my mom babysit tonight... %kid1 and %kid2 should see their grandparents every once in a while.#$b#Totally not because I want some more alone time with you...$3",
          "TwoKids_1": "I love our little family more than you know.$h#$b#I wish we could stay like this forever.$10",
          "TwoKids_2": "I can't believe how lucky I got with you and our two kids...$10#$b#They're almost as adorable as you.$l",
          "Good_0": "I've been good lately right?$h#$b#So does that mean you'll let me fuck you tonight?$l",
          "Good_1": "God I love when you wear that...$l#$b#You sure you need to work on the farm today?$l",
          "Good_2": "Sometimes I can't believe how lucky I am to have met you.$l#$b#You're so beautiful I might just force you to stay home with me all the time...$10",
          "Good_3": "Kiss me, I think my heart might break if I have to wait any longer for your touch...$3",
          "Good_4": "Please baby, I need a kiss.$h#$b#I can't stop thinking about those sweet lips of yours.$3",
          "Good_5": "%You see sam fiddling around with a camera, it looks similar to the one you caught him messing with before you were married.#$b#Oh... Hey @... $10#$b#Why am I still fiddling around with cameras?$8#$b#You think I can go all day without seeing you?$3#$b#Do you even know me?$3",
          "Good_6": "%Sam looks at you lovingly... maybe even a little seductively...",
          "Good_7": "You should've seen how you looked last night taking me in.$l#$b#I'll definitely be thinking about it today when I finish setting up new cameras around the house...$h#$b#Don't worry, only I'll be able to see them.$3",
          "Good_8": "Come back home soon.$3#$b#I want to show you this new sex position I've been thinking about...$h#$b#It'll let me uh... see you a lot better...$10",
          "Neutral_0": "You look amazing with those bruises on you...$l#$b#I think I might just leave a few more on you tonight...$3",
          "Neutral_1": "For fuck's sake babe, stop looking at me like that.$9#$b#I'm getting hard again just thinking about what you did to me last night.$10",
          "Neutral_2": "Don't worry about the farm today...$3#$b#I have something a lot bigger for you to handle...$l",
          "Bad_0": "Oh, your wrists hurt from the rope I put on you last night?$9#$b#Good, that's how I've been feeling lately.$5#$b#I will force you to stay mine if it's the last thing I do.$5",
          "Bad_1": "I heard you moan out another guys' name last night...$5#$b#Do I need to kill them for you to come back to me?$9",
          "Bad_2": "Please baby, I can't take this treatment anymore.$2#$b#I need you, I need you so bad.$9",
          "funLeave_Sam": "Hey @, I'm gonna go out for a little bit..$h#$b#Don't worry, I'll bring back a gift just for you.$3",
          "funReturn_Sam": "I told you I'd bring back something for you.$3#$b#I made an extra stop to Gus' for you.[224]$h",
          "spouseRoom_Sam": "Good morning baby, did you sleep well?$h#$b#Here, I woke up early to make you some coffee.[395]$3",
          "spring_1": "The air feels so good now that it's spring again.#$b#Maybe I'll fuck you outside today.$3",
          "spring_4": "Ugh, I can't seem to get the stove working.$2#$b#Will you show me how to do it again, baby?$9#$b#Don't be shy, I like a hands-on instructor...$h",
          "spring_8": "Hey, you know why I love Spring now?$h#$b#It's because I can give you all the flowers I can find... $3#$b#Or steal from Granny Evelyn...$10#$b#Here, I 'found' this one for you...[597]$3",
          "spring_12": "Don't worry about the egg festival tomorrow, I have a plan to keep Abigail from winning...$3#$b#No, I promise it's nothing too bad...$9#$b#I just really want you to win this year.$3",
          "spring_16": "Here, I got you this so you can wear in your hair today...[591]$h",
          "spring_23": "You should totally wear that one outfit for the flower dance tomorrow, it really turns me on...$l#$b#God, I'm gonna have to take another cold shower today.$10",
          "summer_1": "I love Summer...$3#$b#More sweating means more showers, right?$h#$b#Can't promise you'll be alone for those showers though...$l",
          "summer_7": "Here, I was walking past a bunch earlier before you woke up.[593]$3#$b#I thought it'd go well with your eyes...$h",
          "summer_10": "What do you think about taking a road trip once harvest season is over?#$b#I think you deserve a break, and I really want to drive you around the country for a few weeks...$3",
          "summer_16": "You better have gotten me a good gift for my birthday tomorrow.$l#$b#Who am I kidding? I'd honestly be happy with a naked lap dance...$3",
          "summer_28": "Hey baby, don't forget about the moonlight jellies tonight.$h#$b#I want to see your pretty little lips glow while we make out...$l",
          "fall_1": "Fall weather is perfect for concerts...$h#$b#I might just break out the guitar tonight and serenade you.$10",
          "fall_8": "Make sure you put on a scarf today...#$b#It's a bit chilly and I don't want you catching a cold.$h#$b#Or don't... I'd love nothing more than to nurse you back to health.$3",
          "fall_15": "Hey, did you see that the fair is tomorrow?#$b#I know we're married now, but I still want to win all the prizes for you.$3",
          "fall_17": "Here, in case you didn't get everything you wanted at the fair yesterday.[74]$3",
          "fall_18": "Don't worry, baby. I'll get the house prepared for Winter.#$b#You focus on looking cute and taking care of our farm.$3",
          "fall_20": "Here's a little something for you.[595]#$b#Don't worry, even though winter's coming and flowers won't be as common...#$b#I'll still find a way brighten your day.$3",
          "fall_26": "Excited for Spirit's Eve tomorrow?$3#$b#Well, no matter what happens, I'll still make you scream louder than that maze ever will...$l",
          "winter_1": "God, it's so cold out.$9#$b#Hey, since you can't grow much in winter...$h#$b#You should definitely stay home and cuddle with me more often.$h",
          "winter_5": "Wanna have a snow fight?$h#$b#Or maybe we could just fight in bed...$3#$b#Can't say you'll win either way...$3",
          "winter_9": "Close your eyes, I have something for you.$3#$b#[418]I told you I'd find something in winter that'll brighten your day.$h",
          "winter_17": "Did you get everything you wanted at the night market?#$b#I actually got you this.[240]$3#$b#What? I thought it was fitting...$h",
          "winter_24": "I know you might not be my secret friend, but I hope you'll still get me something...$2#$b#I know I'll be giving you something big tomorrow night...$l",
          "winter_28": "Last day of the year, huh...#$b#Everyday I've spent with you this year has been the best of my life.$l#$e#I really don't know what I'd do without you.$10"
        }
      }
    ]
  }